# Derek Sandefur
## Week 13 - 4/11/2024 - 4/16/2024
### Python - Pandas DataFrame Processing

In [1]:
import numpy as np

import pandas as pd
from pandas import Series,DataFrame

In [2]:
df = DataFrame(np.arange(16).reshape(4,4), 
              index=['Ohio', 'Colorado', 'Utah', 'New York'],
              columns=['one', 'two', 'three', 'four']
              )
df

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [3]:
df.values

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15]])

In [4]:
df['one']

Ohio         0
Colorado     4
Utah         8
New York    12
Name: one, dtype: int32

In [5]:
s= df['two']
s

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [6]:
type(s)

pandas.core.series.Series

In [7]:
df.loc['Colorado']

one      4
two      5
three    6
four     7
Name: Colorado, dtype: int32

In [8]:
df.loc[['Colorado', 'Ohio']]

          one  two  three  four
Colorado    4    5      6     7
Ohio        0    1      2     3

In [9]:
df[['one', 'two']]

          one  two
Ohio        0    1
Colorado    4    5
Utah        8    9
New York   12   13

In [10]:
df.iloc[0]

one      0
two      1
three    2
four     3
Name: Ohio, dtype: int32

In [12]:
df.iloc[0,2]

2

In [14]:
df

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [15]:
df['five'] = np.arange(1,5)

In [16]:
df

          one  two  three  four  five
Ohio        0    1      2     3     1
Colorado    4    5      6     7     2
Utah        8    9     10    11     3
New York   12   13     14    15     4

In [17]:
# drop
df1 = df.copy()
df2 = df.copy()

In [18]:
df.drop(['Colorado'])

          one  two  three  four  five
Ohio        0    1      2     3     1
Utah        8    9     10    11     3
New York   12   13     14    15     4

In [19]:
df.drop(['Colorado', 'Utah'])

          one  two  three  four  five
Ohio        0    1      2     3     1
New York   12   13     14    15     4

In [20]:
df

          one  two  three  four  five
Ohio        0    1      2     3     1
Colorado    4    5      6     7     2
Utah        8    9     10    11     3
New York   12   13     14    15     4

In [21]:
df.drop('five', axis='columns')

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [22]:
df.drop(['five','one'], axis=1)

          two  three  four
Ohio        1      2     3
Colorado    5      6     7
Utah        9     10    11
New York   13     14    15

In [23]:
df

          one  two  three  four  five
Ohio        0    1      2     3     1
Colorado    4    5      6     7     2
Utah        8    9     10    11     3
New York   12   13     14    15     4

In [24]:
df.drop(['five','one'], inplace=True, axis=1)

In [25]:
df

          two  three  four
Ohio        1      2     3
Colorado    5      6     7
Utah        9     10    11
New York   13     14    15

In [26]:
df.drop(['New York', 'Ohio'], inplace=True)

In [27]:
df

          two  three  four
Colorado    5      6     7
Utah        9     10    11

In [28]:
df1

          one  two  three  four  five
Ohio        0    1      2     3     1
Colorado    4    5      6     7     2
Utah        8    9     10    11     3
New York   12   13     14    15     4

In [29]:
df2

          one  two  three  four  five
Ohio        0    1      2     3     1
Colorado    4    5      6     7     2
Utah        8    9     10    11     3
New York   12   13     14    15     4

In [30]:
#select entries
df1

          one  two  three  four  five
Ohio        0    1      2     3     1
Colorado    4    5      6     7     2
Utah        8    9     10    11     3
New York   12   13     14    15     4

In [31]:
df1[['one', 'five']]

          one  five
Ohio        0     1
Colorado    4     2
Utah        8     3
New York   12     4

In [33]:
df1[:2]

          one  two  three  four  five
Ohio        0    1      2     3     1
Colorado    4    5      6     7     2

In [34]:
df1

          one  two  three  four  five
Ohio        0    1      2     3     1
Colorado    4    5      6     7     2
Utah        8    9     10    11     3
New York   12   13     14    15     4

In [35]:
df1[df1['three']>5]

          one  two  three  four  five
Colorado    4    5      6     7     2
Utah        8    9     10    11     3
New York   12   13     14    15     4

In [36]:
df1 > 5

            one    two  three   four   five
Ohio      False  False  False  False  False
Colorado  False  False   True   True  False
Utah       True   True   True   True  False
New York   True   True   True   True  False

In [37]:
df1[df1 < 5] = 0

In [38]:
df1

          one  two  three  four  five
Ohio        0    0      0     0     0
Colorado    0    5      6     7     0
Utah        8    9     10    11     0
New York   12   13     14    15     0

In [39]:
#select entries with Loc and iloc
df1.loc['Colorado']

one      0
two      5
three    6
four     7
five     0
Name: Colorado, dtype: int32

In [40]:
df1.loc['Colorado',['two','four']]

two     5
four    7
Name: Colorado, dtype: int32

In [41]:
df1.loc[['Colorado', 'Ohio'],['two','four']]

          two  four
Colorado    5     7
Ohio        0     0

In [42]:
df1.iloc[1,2]

6

In [43]:
df1.iloc[0]

one      0
two      0
three    0
four     0
five     0
Name: Ohio, dtype: int32

In [44]:
df1.iloc[:2]

          one  two  three  four  five
Ohio        0    0      0     0     0
Colorado    0    5      6     7     0

In [45]:
df1.iloc[:2,::2]

          one  three  five
Ohio        0      0     0
Colorado    0      6     0

In [46]:
df1.values

array([[ 0,  0,  0,  0,  0],
       [ 0,  5,  6,  7,  0],
       [ 8,  9, 10, 11,  0],
       [12, 13, 14, 15,  0]])

In [47]:
df1.iloc[[1,3],[0,2]]

          one  three
Colorado    0      6
New York   12     14

In [48]:
df1 = DataFrame(np.arange(9).reshape(3,3),
               columns= list('bcd'),
               index=['Ohio', 'Texas', 'Colorado'])
df1

          b  c  d
Ohio      0  1  2
Texas     3  4  5
Colorado  6  7  8

In [49]:
df2 = DataFrame(np.arange(12).reshape(4,3),
               columns=list('bde'),
               index= ['Utah', 'Ohio', 'Texas', 'Oregon'])
df2

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [50]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [51]:
# fill the nan + number with 0
df1.add(df2,fill_value=0)

            b    c     d     e
Colorado  6.0  7.0   8.0   NaN
Ohio      3.0  1.0   6.0   5.0
Oregon    9.0  NaN  10.0  11.0
Texas     9.0  4.0  12.0   8.0
Utah      0.0  NaN   1.0   2.0

In [52]:
df1

          b  c  d
Ohio      0  1  2
Texas     3  4  5
Colorado  6  7  8

In [53]:
df1['e'] = df1['b'] + df1['d']
df1

          b  c  d   e
Ohio      0  1  2   2
Texas     3  4  5   8
Colorado  6  7  8  14

In [54]:
df1.add(df2,fill_value=0)

            b    c     d     e
Colorado  6.0  7.0   8.0  14.0
Ohio      3.0  1.0   6.0   7.0
Oregon    9.0  NaN  10.0  11.0
Texas     9.0  4.0  12.0  16.0
Utah      0.0  NaN   1.0   2.0

In [56]:
df2

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [57]:
#Operation between DataFrame and Series
s = df2.iloc[0]
s

b    0
d    1
e    2
Name: Utah, dtype: int32

In [58]:
df2 - s

        b  d  e
Utah    0  0  0
Ohio    3  3  3
Texas   6  6  6
Oregon  9  9  9

In [59]:
#sort and rank
df3 = DataFrame(np.arange(8).reshape(2,4),
               index=['three','one'],
               columns=list('dabc'))
df3

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [60]:
df3.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [61]:
df3

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [62]:
df3.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [63]:
df3.sort_index(axis=1,ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [64]:
#Sort data frame by values
df4 = DataFrame({'a': [4,7,-3,0,-2], 'b':[1,5,-5,0,2]})
df4

   a  b
0  4  1
1  7  5
2 -3 -5
3  0  0
4 -2  2

In [65]:
#Sort data by columns 'a', 'b'
df4.sort_values(by='b')

   a  b
2 -3 -5
3  0  0
0  4  1
4 -2  2
1  7  5

In [66]:
df4.sort_values(by='a')

   a  b
2 -3 -5
4 -2  2
3  0  0
0  4  1
1  7  5

In [67]:
df4

   a  b
0  4  1
1  7  5
2 -3 -5
3  0  0
4 -2  2

In [10]:
import pandas as pd
import numpy as np
from pandas import * # import everything from pandas

In [11]:
# start 4/16/2024
df = DataFrame({'b' :[4,7,-3,2], 'a':[0,-1,3,2]})
df

   b  a
0  4  0
1  7 -1
2 -3  3
3  2  2

In [12]:
df.sort_values(by='a')

   b  a
1  7 -1
0  4  0
3  2  2
2 -3  3

In [13]:
df.sort_values(by='b')

   b  a
2 -3  3
3  2  2
0  4  0
1  7 -1

In [14]:
df

   b  a
0  4  0
1  7 -1
2 -3  3
3  2  2

In [15]:
df.sort_values(by=['a','b'])

   b  a
1  7 -1
0  4  0
3  2  2
2 -3  3

In [16]:
#ranking data
df = DataFrame({'b':[14,17,-13,12], 'a':[10,11,15,11]})
df

    b   a
0  14  10
1  17  11
2 -13  15
3  12  11

In [17]:
df.rank()

     b    a
0  3.0  1.0
1  4.0  2.5
2  1.0  4.0
3  2.0  2.5

In [18]:
df.rank().astype(int)

   b  a
0  3  1
1  4  2
2  1  4
3  2  2

In [20]:
#Summarizing Data
df = DataFrame([[1.4,np.nan], [7.1,-4.5], [np.nan,np.nan], [0.75,-1.3]],
              index= list('abcd'),
              columns=['one','two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [21]:
df.values

array([[ 1.4 ,   nan],
       [ 7.1 , -4.5 ],
       [  nan,   nan],
       [ 0.75, -1.3 ]])

In [22]:
df.values.shape

(4, 2)

In [23]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, a to d
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   one     3 non-null      float64
 1   two     2 non-null      float64
dtypes: float64(2)
memory usage: 96.0+ bytes

In [25]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [26]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [27]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [28]:
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [29]:
df.mean(axis=1)

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [30]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [31]:
df.mean(axis=1,skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [32]:
df.min()

one    0.75
two   -4.50
dtype: float64

In [33]:
df.max()

one    7.1
two   -1.3
dtype: float64

In [34]:
df.min(axis=1)

a    1.4
b   -4.5
c    NaN
d   -1.3
dtype: float64

In [35]:
df.max(axis=1)

a    1.40
b    7.10
c     NaN
d    0.75
dtype: float64

In [36]:
# idxmax() return index of first occurrence of maximum over requested axis.
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [37]:
df.idxmax()

one    b
two    d
dtype: object

In [38]:
df.idxmax(axis=1)

a    one
b    one
c    NaN
d    one
dtype: object

In [39]:
# missing data np.nan
df = DataFrame([ [1,2,3,4], [np.nan,5,6], [7,np.nan,9], [np.nan,np.nan,np.nan]],
              )
df

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  NaN  5.0  6.0  NaN
2  7.0  NaN  9.0  NaN
3  NaN  NaN  NaN  NaN

In [40]:
df1 = df.copy()
df.dropna()

     0    1    2    3
0  1.0  2.0  3.0  4.0

In [41]:
df

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  NaN  5.0  6.0  NaN
2  7.0  NaN  9.0  NaN
3  NaN  NaN  NaN  NaN

In [42]:
# how
df.dropna(how='any')

     0    1    2    3
0  1.0  2.0  3.0  4.0

In [43]:
df.dropna(how='all')

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  NaN  5.0  6.0  NaN
2  7.0  NaN  9.0  NaN

In [44]:
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [45]:
df.dropna(how='all', axis=1)

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  NaN  5.0  6.0  NaN
2  7.0  NaN  9.0  NaN
3  NaN  NaN  NaN  NaN

In [46]:
df.dropna(thresh=2) #Keep only the rows having 2 or more valid data

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  NaN  5.0  6.0  NaN
2  7.0  NaN  9.0  NaN

In [47]:
df.dropna(thresh=3)

     0    1    2    3
0  1.0  2.0  3.0  4.0

In [48]:
df.dropna(thresh=2, axis=1)

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [49]:
df

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  NaN  5.0  6.0  NaN
2  7.0  NaN  9.0  NaN
3  NaN  NaN  NaN  NaN

In [50]:
df.dropna(thresh=2, axis=1, inplace=True)

In [51]:
df

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [53]:
# fillna
df.fillna(1)

     0    1    2
0  1.0  2.0  3.0
1  1.0  5.0  6.0
2  7.0  1.0  9.0
3  1.0  1.0  1.0

In [54]:
df.fillna(0,inplace=True)

In [55]:
df

     0    1    2
0  1.0  2.0  3.0
1  0.0  5.0  6.0
2  7.0  0.0  9.0
3  0.0  0.0  0.0

In [56]:
# value counts
df = DataFrame({ 
    
    'Qu1' :[10,30,40,30,40],
    'Qu2' :[20,30,10,20,30],
    'Qu3' :[10,50,20,40,40]},
    index = list('abcde'))
    
df

   Qu1  Qu2  Qu3
a   10   20   10
b   30   30   50
c   40   10   20
d   30   20   40
e   40   30   40

In [57]:
df.values

array([[10, 20, 10],
       [30, 30, 50],
       [40, 10, 20],
       [30, 20, 40],
       [40, 30, 40]], dtype=int64)

In [58]:
df['Qu1'].value_counts()

30    2
40    2
10    1
Name: Qu1, dtype: int64

In [59]:
df['Qu3'].value_counts()

40    2
20    1
10    1
50    1
Name: Qu3, dtype: int64

In [60]:
df

   Qu1  Qu2  Qu3
a   10   20   10
b   30   30   50
c   40   10   20
d   30   20   40
e   40   30   40

In [61]:
df.loc['c'].value_counts()

20    1
10    1
40    1
Name: c, dtype: int64

In [62]:
df.iloc[2].value_counts()

20    1
10    1
40    1
Name: c, dtype: int64

In [63]:
# apply the value_counts method to the entire DataFrame
df.apply(pd.value_counts)

    Qu1  Qu2  Qu3
10  1.0  1.0  1.0
20  NaN  2.0  1.0
30  2.0  2.0  NaN
40  2.0  NaN  2.0
50  NaN  NaN  1.0

In [64]:
df

   Qu1  Qu2  Qu3
a   10   20   10
b   30   30   50
c   40   10   20
d   30   20   40
e   40   30   40

In [65]:
df.apply(pd.value_counts).fillna(0)

    Qu1  Qu2  Qu3
10  1.0  1.0  1.0
20  0.0  2.0  1.0
30  2.0  2.0  0.0
40  2.0  0.0  2.0
50  0.0  0.0  1.0

In [66]:
df.apply(pd.value_counts).fillna(0).astype(int)

    Qu1  Qu2  Qu3
10    1    1    1
20    0    2    1
30    2    2    0
40    2    0    2
50    0    0    1

In [67]:
df

   Qu1  Qu2  Qu3
a   10   20   10
b   30   30   50
c   40   10   20
d   30   20   40
e   40   30   40

In [68]:
rs = df.apply(pd.value_counts).fillna(0).astype(int)
rs

    Qu1  Qu2  Qu3
10    1    1    1
20    0    2    1
30    2    2    0
40    2    0    2
50    0    0    1

In [70]:
rs.index.name='values'
rs

        Qu1  Qu2  Qu3
values
10        1    1    1
20        0    2    1
30        2    2    0
40        2    0    2
50        0    0    1

In [71]:
rs.columns.name= 'questions'
rs

questions  Qu1  Qu2  Qu3
values
10           1    1    1
20           0    2    1
30           2    2    0
40           2    0    2
50           0    0    1

In [72]:
rs1 = df.apply(pd.value_counts, axis=1).fillna(0).astype(int)
rs1

   10  20  30  40  50
a   2   1   0   0   0
b   0   0   2   0   1
c   1   1   0   1   0
d   0   1   1   1   0
e   0   0   1   2   0